Revit 2026 API

# ValueAtPointBase Properties

---

The ValueAtPointBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ValueAtPointBase Class

Autodesk.Revit.DB Namespace